[NoCoverage] ConditionalExpression
src/ReceiptPrinter.ts:7:28
 
 export class ReceiptPrinter {
 
-    private readonly EOL = process.platform === "win32" ? "\r\n" : "\n";
+    private readonly EOL = false ? "\r\n" : "\n";
 
     public constructor(private readonly columns: number = 40) {

[NoCoverage] ConditionalExpression
src/ReceiptPrinter.ts:7:28
 
 export class ReceiptPrinter {
 
-    private readonly EOL = process.platform === "win32" ? "\r\n" : "\n";
+    private readonly EOL = true ? "\r\n" : "\n";
 
     public constructor(private readonly columns: number = 40) {

[NoCoverage] BlockStatement
src/ReceiptPrinter.ts:14:48
 
     public printReceipt( receipt: Receipt): string {
         let result = "";
-        for (const item of receipt.getItems()) {
-            let price = this.format2Decimals(item.totalPrice);
-            let quantity = ReceiptPrinter.presentQuantity(item);
-            let name = item.product.name;
-            let unitPrice = this.format2Decimals(item.price);
-
-            let whitespaceSize = this.columns - name.length - price.length;
-            let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
-
-            if (item.quantity != 1) {
-                line += "  " + unitPrice + " * " + quantity + this.EOL;
-            }
-            result += line;
-        }
+        for (const item of receipt.getItems()) {}
         for (const discount of receipt.getDiscounts()) {
             let productPresentation = discount.product.name;

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:20:34
             let name = item.product.name;
             let unitPrice = this.format2Decimals(item.price);
 
-            let whitespaceSize = this.columns - name.length - price.length;
+            let whitespaceSize = this.columns + name.length - price.length;
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:20:34
             let name = item.product.name;
             let unitPrice = this.format2Decimals(item.price);
 
-            let whitespaceSize = this.columns - name.length - price.length;
+            let whitespaceSize = this.columns - name.length + price.length;
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:21:24
             let unitPrice = this.format2Decimals(item.price);
 
             let whitespaceSize = this.columns - name.length - price.length;
-            let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
+            let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price - this.EOL;
 
             if (item.quantity != 1) {

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:21:24
             let unitPrice = this.format2Decimals(item.price);
 
             let whitespaceSize = this.columns - name.length - price.length;
-            let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
+            let line = name - ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 
             if (item.quantity != 1) {

[NoCoverage] ConditionalExpression
src/ReceiptPrinter.ts:23:17
             let whitespaceSize = this.columns - name.length - price.length;
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 
-            if (item.quantity != 1) {
+            if (true) {
                 line += "  " + unitPrice + " * " + quantity + this.EOL;
             }

[NoCoverage] EqualityOperator
src/ReceiptPrinter.ts:23:17
             let whitespaceSize = this.columns - name.length - price.length;
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 
-            if (item.quantity != 1) {
+            if (item.quantity == 1) {
                 line += "  " + unitPrice + " * " + quantity + this.EOL;
             }

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:24:25
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 
             if (item.quantity != 1) {
-                line += "  " + unitPrice + " * " + quantity + this.EOL;
+                line += "  " + unitPrice + " * " + quantity - this.EOL;
             }
             result += line;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:24:17
             let line = name + ReceiptPrinter.getWhitespace(whitespaceSize) + price + this.EOL;
 
             if (item.quantity != 1) {
-                line += "  " + unitPrice + " * " + quantity + this.EOL;
+                line -= "  " + unitPrice + " * " + quantity + this.EOL;
             }
             result += line;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:26:13
             if (item.quantity != 1) {
                 line += "  " + unitPrice + " * " + quantity + this.EOL;
             }
-            result += line;
+            result -= line;
         }
         for (const discount of receipt.getDiscounts()) {

[NoCoverage] BlockStatement
src/ReceiptPrinter.ts:28:56
             }
             result += line;
         }
-        for (const discount of receipt.getDiscounts()) {
-            let productPresentation = discount.product.name;
-            let pricePresentation = this.format2Decimals(discount.discountAmount);
-            let description = discount.description;
-            result += description;
-            result += "(";
-            result += productPresentation;
-            result += ")";
-            result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);
-            result += "-";
-            result += pricePresentation;
-            result += this.EOL;
-        }
+        for (const discount of receipt.getDiscounts()) {}
         result += this.EOL;
         let pricePresentation = this.format2Decimals(receipt.getTotalPrice());

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:32:13
             let productPresentation = discount.product.name;
             let pricePresentation = this.format2Decimals(discount.discountAmount);
             let description = discount.description;
-            result += description;
+            result -= description;
             result += "(";
             result += productPresentation;

[NoCoverage] StringLiteral
src/ReceiptPrinter.ts:33:23
             let pricePresentation = this.format2Decimals(discount.discountAmount);
             let description = discount.description;
             result += description;
-            result += "(";
+            result += "";
             result += productPresentation;
             result += ")";

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:34:13
             let description = discount.description;
             result += description;
             result += "(";
-            result += productPresentation;
+            result -= productPresentation;
             result += ")";
             result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:36:52
             result += "(";
             result += productPresentation;
             result += ")";
-            result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);
+            result += ReceiptPrinter.getWhitespace(this.columns - 3 + productPresentation.length - description.length - pricePresentation.length);
             result += "-";
             result += pricePresentation;

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:36:52
             result += "(";
             result += productPresentation;
             result += ")";
-            result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);
+            result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length + description.length - pricePresentation.length);
             result += "-";
             result += pricePresentation;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:38:13
             result += ")";
             result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);
             result += "-";
-            result += pricePresentation;
+            result -= pricePresentation;
             result += this.EOL;
         }

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:39:13
             result += ReceiptPrinter.getWhitespace(this.columns - 3 - productPresentation.length - description.length - pricePresentation.length);
             result += "-";
             result += pricePresentation;
-            result += this.EOL;
+            result -= this.EOL;
         }
         result += this.EOL;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:41:9
             result += pricePresentation;
             result += this.EOL;
         }
-        result += this.EOL;
+        result -= this.EOL;
         let pricePresentation = this.format2Decimals(receipt.getTotalPrice());
         let total = "Total: ";

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:44:55
         result += this.EOL;
         let pricePresentation = this.format2Decimals(receipt.getTotalPrice());
         let total = "Total: ";
-        let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length - pricePresentation.length);
+        let whitespace = ReceiptPrinter.getWhitespace(this.columns + total.length - pricePresentation.length);
         result += total;
         result += whitespace;

[NoCoverage] ArithmeticOperator
src/ReceiptPrinter.ts:44:55
         result += this.EOL;
         let pricePresentation = this.format2Decimals(receipt.getTotalPrice());
         let total = "Total: ";
-        let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length - pricePresentation.length);
+        let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length + pricePresentation.length);
         result += total;
         result += whitespace;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:45:9
         let pricePresentation = this.format2Decimals(receipt.getTotalPrice());
         let total = "Total: ";
         let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length - pricePresentation.length);
-        result += total;
+        result -= total;
         result += whitespace;
         result += pricePresentation;

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:46:9
         let total = "Total: ";
         let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length - pricePresentation.length);
         result += total;
-        result += whitespace;
+        result -= whitespace;
         result += pricePresentation;
 

[NoCoverage] AssignmentOperator
src/ReceiptPrinter.ts:47:9
         let whitespace = ReceiptPrinter.getWhitespace(this.columns - total.length - pricePresentation.length);
         result += total;
         result += whitespace;
-        result += pricePresentation;
+        result -= pricePresentation;
 
         return result;

[NoCoverage] BlockStatement
src/ReceiptPrinter.ts:52:45
         return result;
     }
 
-    private format2Decimals(number: number) {
-        return new Intl.NumberFormat('en-UK', {
-            minimumFractionDigits: 2,
-            maximumFractionDigits: 2
-        }).format(number)
-    }
+    private format2Decimals(number: number) {}
 
     private static presentQuantity( item: ReceiptItem): string  {

[NoCoverage] BlockStatement
src/ReceiptPrinter.ts:59:65
         }).format(number)
     }
 
-    private static presentQuantity( item: ReceiptItem): string  {
-        return ProductUnit.Each == item.product.unit
-            // TODO make sure this is the simplest way to make something similar to the java version
-                ? new Intl.NumberFormat('en-UK', {maximumFractionDigits: 0}).format(item.quantity)
-                : new Intl.NumberFormat('en-UK', {minimumFractionDigits: 3}).format(item.quantity);
-    }
+    private static presentQuantity( item: ReceiptItem): string  {}
 
     private static getWhitespace(whitespaceSize: number): string {

[NoCoverage] ConditionalExpression
src/ReceiptPrinter.ts:60:16
     }
 
     private static presentQuantity( item: ReceiptItem): string  {
-        return ProductUnit.Each == item.product.unit
+        return false
             // TODO make sure this is the simplest way to make something similar to the java version
                 ? new Intl.NumberFormat('en-UK', {maximumFractionDigits: 0}).format(item.quantity)

[NoCoverage] ConditionalExpression
src/ReceiptPrinter.ts:60:16
     }
 
     private static presentQuantity( item: ReceiptItem): string  {
-        return ProductUnit.Each == item.product.unit
+        return true
             // TODO make sure this is the simplest way to make something similar to the java version
                 ? new Intl.NumberFormat('en-UK', {maximumFractionDigits: 0}).format(item.quantity)

[NoCoverage] ObjectLiteral
src/ReceiptPrinter.ts:63:50
         return ProductUnit.Each == item.product.unit
             // TODO make sure this is the simplest way to make something similar to the java version
                 ? new Intl.NumberFormat('en-UK', {maximumFractionDigits: 0}).format(item.quantity)
-                : new Intl.NumberFormat('en-UK', {minimumFractionDigits: 3}).format(item.quantity);
+                : new Intl.NumberFormat('en-UK', {}).format(item.quantity);
     }
 

[NoCoverage] StringLiteral
src/ReceiptPrinter.ts:63:41
         return ProductUnit.Each == item.product.unit
             // TODO make sure this is the simplest way to make something similar to the java version
                 ? new Intl.NumberFormat('en-UK', {maximumFractionDigits: 0}).format(item.quantity)
-                : new Intl.NumberFormat('en-UK', {minimumFractionDigits: 3}).format(item.quantity);
+                : new Intl.NumberFormat("", {minimumFractionDigits: 3}).format(item.quantity);
     }
 

[NoCoverage] BlockStatement
src/ReceiptPrinter.ts:66:66
                 : new Intl.NumberFormat('en-UK', {minimumFractionDigits: 3}).format(item.quantity);
     }
 
-    private static getWhitespace(whitespaceSize: number): string {
-        return " ".repeat(whitespaceSize);
-    }
+    private static getWhitespace(whitespaceSize: number): string {}
 }
 

[NoCoverage] StringLiteral
src/ReceiptPrinter.ts:67:16
     }
 
     private static getWhitespace(whitespaceSize: number): string {
-        return " ".repeat(whitespaceSize);
+        return "".repeat(whitespaceSize);
     }
 }
