[NoCoverage] BlockStatement
src/model/Offer.ts:11:27
                        public readonly argument: number) {
     }
 
-    getProduct(): Product {
-        return this.product;
-    }
+    getProduct(): Product {}
 
 }
