[Killed] BlockStatement
src/model/Receipt.ts:10:36
     private items: ReceiptItem[] = [];
     private discounts: Discount[] = [];
 
-    public getTotalPrice(): number {
-        let total = 0.0;
-        for (let item of this.items) {
-            total += item.totalPrice;
-        }
-        for ( let discount of this.discounts) {
-            total -= discount.discountAmount;
-        }
-        return total;
-    }
+    public getTotalPrice(): number {}
 
     public addProduct( p: Product, quantity: number, price: number, totalPrice: number): void {
killedBy: Supermarket No discount
statusReason: expected undefined to be a number

[Killed] BlockStatement
src/model/Receipt.ts:12:38
 
     public getTotalPrice(): number {
         let total = 0.0;
-        for (let item of this.items) {
-            total += item.totalPrice;
-        }
+        for (let item of this.items) {}
         for ( let discount of this.discounts) {
             total -= discount.discountAmount;
killedBy: Supermarket No discount
statusReason: expected +0 to be close to 4.975 +/- 0.01

[Killed] AssignmentOperator
src/model/Receipt.ts:13:13
     public getTotalPrice(): number {
         let total = 0.0;
         for (let item of this.items) {
-            total += item.totalPrice;
+            total -= item.totalPrice;
         }
         for ( let discount of this.discounts) {
killedBy: Supermarket No discount
statusReason: expected -4.975 to be close to 4.975 +/- 0.01

[Killed] BlockStatement
src/model/Receipt.ts:15:47
         for (let item of this.items) {
             total += item.totalPrice;
         }
-        for ( let discount of this.discounts) {
-            total -= discount.discountAmount;
-        }
+        for ( let discount of this.discounts) {}
         return total;
     }
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] AssignmentOperator
src/model/Receipt.ts:16:13
             total += item.totalPrice;
         }
         for ( let discount of this.discounts) {
-            total -= discount.discountAmount;
+            total += discount.discountAmount;
         }
         return total;
killedBy: Supermarket Ten percent discount
statusReason: expected 1.089 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/Receipt.ts:21:95
         return total;
     }
 
-    public addProduct( p: Product, quantity: number, price: number, totalPrice: number): void {
-        this.items.push(new ReceiptItem(p, quantity, price, totalPrice));
-    }
+    public addProduct( p: Product, quantity: number, price: number, totalPrice: number): void {}
 
     public getItems(): ReceiptItem[] {
killedBy: Supermarket No discount
statusReason: expected +0 to be close to 4.975 +/- 0.01

[Killed] BlockStatement
src/model/Receipt.ts:25:38
         this.items.push(new ReceiptItem(p, quantity, price, totalPrice));
     }
 
-    public getItems(): ReceiptItem[] {
-        return _.clone(this.items);
-    }
+    public getItems(): ReceiptItem[] {}
 
     public addDiscount( discount: Discount): void {
killedBy: Supermarket No discount
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/model/Receipt.ts:29:51
         return _.clone(this.items);
     }
 
-    public addDiscount( discount: Discount): void {
-        this.discounts.push(discount);
-    }
+    public addDiscount( discount: Discount): void {}
 
     public getDiscounts(): Discount[] {
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/Receipt.ts:33:39
         this.discounts.push(discount);
     }
 
-    public getDiscounts(): Discount[] {
-        return this.discounts;
-    }
+    public getDiscounts(): Discount[] {}
 }
 
killedBy: Supermarket No discount
statusReason: Cannot read properties of undefined (reading 'length')
