[Survived] BlockStatement
src/model/ProductQuantity.ts:6:51
 export class ProductQuantity {
 
     constructor(public readonly product: Product,
-                public readonly quantity: number) {
-        this.product = product;
-        this.quantity = quantity;
-    }
+                public readonly quantity: number) {}
 }
 
