[Killed] ArrayDeclaration
src/model/ShoppingCart.ts:15:50
 
 export class ShoppingCart {
 
-    private readonly  items: ProductQuantity[] = [];
+    private readonly  items: ProductQuantity[] = ["Stryker was here"];
     _productQuantities: ProductQuantities = {};
 
killedBy: Supermarket No discount
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/model/ShoppingCart.ts:19:35
     _productQuantities: ProductQuantities = {};
 
 
-    getItems(): ProductQuantity[] {
-        return _.clone(this.items);
-    }
+    getItems(): ProductQuantity[] {}
 
     addItem(product: Product): void {
killedBy: Supermarket No discount
statusReason: productQuantities is not iterable

[Killed] BlockStatement
src/model/ShoppingCart.ts:23:37
         return _.clone(this.items);
     }
 
-    addItem(product: Product): void {
-        this.addItemQuantity(product, 1.0);
-    }
+    addItem(product: Product): void {}
 
     productQuantities(): ProductQuantities {
killedBy: Supermarket addItem adds single quantity
statusReason: expected +0 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:27:44
         this.addItemQuantity(product, 1.0);
     }
 
-    productQuantities(): ProductQuantities {
-        return this._productQuantities;
-    }
+    productQuantities(): ProductQuantities {}
 
 
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:32:70
     }
 
 
-    public addItemQuantity(product: Product, quantity: number): void {
-        let productQuantity = new ProductQuantity(product, quantity)
-        this.items.push(productQuantity);
-        let currentQuantity = this._productQuantities[product.name]
-        if (currentQuantity) {
-            this._productQuantities[product.name] = this.increaseQuantity(product, currentQuantity, quantity);
-        } else {
-            this._productQuantities[product.name] = productQuantity;
-        }
-
-    }
+    public addItemQuantity(product: Product, quantity: number): void {}
 
     private increaseQuantity(product: Product, productQuantity: ProductQuantity, quantity: number) {
killedBy: Supermarket No discount
statusReason: expected +0 to be close to 4.975 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:36:30
         let productQuantity = new ProductQuantity(product, quantity)
         this.items.push(productQuantity);
         let currentQuantity = this._productQuantities[product.name]
-        if (currentQuantity) {
-            this._productQuantities[product.name] = this.increaseQuantity(product, currentQuantity, quantity);
-        } else {
+        if (currentQuantity) {} else {
             this._productQuantities[product.name] = productQuantity;
         }
killedBy: Supermarket Same product added multiple times aggregates for discount
statusReason: expected 3.48 to be close to 3 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:36:13
         let productQuantity = new ProductQuantity(product, quantity)
         this.items.push(productQuantity);
         let currentQuantity = this._productQuantities[product.name]
-        if (currentQuantity) {
+        if (false) {
             this._productQuantities[product.name] = this.increaseQuantity(product, currentQuantity, quantity);
         } else {
killedBy: Supermarket Same product added multiple times aggregates for discount
statusReason: expected 3.48 to be close to 3 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:38:16
         let currentQuantity = this._productQuantities[product.name]
         if (currentQuantity) {
             this._productQuantities[product.name] = this.increaseQuantity(product, currentQuantity, quantity);
-        } else {
-            this._productQuantities[product.name] = productQuantity;
-        }
+        } else {}
 
     }
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:44:100
 
     }
 
-    private increaseQuantity(product: Product, productQuantity: ProductQuantity, quantity: number) {
-        return new ProductQuantity(product, productQuantity.quantity + quantity)
-    }
+    private increaseQuantity(product: Product, productQuantity: ProductQuantity, quantity: number) {}
 
     handleOffers(receipt: Receipt,  offers: OffersByProduct, catalog: SupermarketCatalog ):void {
killedBy: Supermarket Same product added multiple times aggregates for discount
statusReason: Cannot read properties of undefined (reading 'product')

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:45:45
     }
 
     private increaseQuantity(product: Product, productQuantity: ProductQuantity, quantity: number) {
-        return new ProductQuantity(product, productQuantity.quantity + quantity)
+        return new ProductQuantity(product, productQuantity.quantity - quantity)
     }
 
killedBy: Supermarket Same product added multiple times aggregates for discount
statusReason: expected 3.96 to be close to 3 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:53:17
             const productQuantity = this._productQuantities[productName]
             const product = productQuantity.product;
             const quantity: number = this._productQuantities[productName].quantity;
-            if (offers[productName]) {
+            if (false) {
                 const offer : Offer = offers[productName];
                 const unitPrice: number= catalog.getUnitPrice(product);
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:53:17
             const productQuantity = this._productQuantities[productName]
             const product = productQuantity.product;
             const quantity: number = this._productQuantities[productName].quantity;
-            if (offers[productName]) {
+            if (true) {
                 const offer : Offer = offers[productName];
                 const unitPrice: number= catalog.getUnitPrice(product);
killedBy: Supermarket No discount
statusReason: Cannot read properties of undefined (reading 'offerType')

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:59:21
                 let quantityAsInt = quantity;
                 let discount : Discount|null = null;
                 let x = 1;
-                if (offer.offerType == SpecialOfferType.ThreeForTwo) {
+                if (true) {
                     x = 3;
 
killedBy: Supermarket Two for amount
statusReason: expected 1.98 to be close to 1.5 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:59:21
                 let quantityAsInt = quantity;
                 let discount : Discount|null = null;
                 let x = 1;
-                if (offer.offerType == SpecialOfferType.ThreeForTwo) {
+                if (false) {
                     x = 3;
 
killedBy: Supermarket Three for two discount
statusReason: expected 5.9399999999999995 to be close to 1.98 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:62:28
                 if (offer.offerType == SpecialOfferType.ThreeForTwo) {
                     x = 3;
 
-                } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
+                } else if (true) {
                     x = 2;
                     if (quantityAsInt >= 2) {
killedBy: Supermarket Five for amount below threshold gives no discount
statusReason: expected 7 to be close to 3.96 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:62:28
                 if (offer.offerType == SpecialOfferType.ThreeForTwo) {
                     x = 3;
 
-                } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
+                } else if (false) {
                     x = 2;
                     if (quantityAsInt >= 2) {
killedBy: Supermarket Two for amount
statusReason: expected 1.98 to be close to 1.5 +/- 0.01

[Killed] BlockStatement
src/model/ShoppingCart.ts:64:45
 
                 } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
                     x = 2;
-                    if (quantityAsInt >= 2) {
-                        const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
-                        const discountN = unitPrice * quantity - total;
-                        discount = new Discount(product, "2 for " + offer.argument, discountN);
-                    }
+                    if (quantityAsInt >= 2) {}
 
                 } if (offer.offerType == SpecialOfferType.FiveForAmount) {
killedBy: Supermarket Two for amount
statusReason: expected 1.98 to be close to 1.5 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:64:25
 
                 } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
                     x = 2;
-                    if (quantityAsInt >= 2) {
+                    if (false) {
                         const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
                         const discountN = unitPrice * quantity - total;
killedBy: Supermarket Two for amount
statusReason: expected 1.98 to be close to 1.5 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:65:88
                 } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
                     x = 2;
                     if (quantityAsInt >= 2) {
-                        const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
+                        const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt * 2 * unitPrice;
                         const discountN = unitPrice * quantity - total;
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
killedBy: Supermarket Two for amount
statusReason: expected 5.46 to be close to 1.5 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:65:88
                 } else if (offer.offerType == SpecialOfferType.TwoForAmount) {
                     x = 2;
                     if (quantityAsInt >= 2) {
-                        const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
+                        const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 / unitPrice;
                         const discountN = unitPrice * quantity - total;
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
killedBy: Supermarket Two for amount buy seven
statusReason: expected 5.51010101010101 to be close to 5.49 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:66:43
                     x = 2;
                     if (quantityAsInt >= 2) {
                         const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
-                        const discountN = unitPrice * quantity - total;
+                        const discountN = unitPrice / quantity - total;
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
                     }
killedBy: Supermarket Two for amount
statusReason: expected 2.985 to be close to 1.5 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:66:43
                     x = 2;
                     if (quantityAsInt >= 2) {
                         const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
-                        const discountN = unitPrice * quantity - total;
+                        const discountN = unitPrice * quantity + total;
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
                     }
killedBy: Supermarket Two for amount
statusReason: expected -1.5 to be close to 1.5 +/- 0.01

[Killed] StringLiteral
src/model/ShoppingCart.ts:67:58
                     if (quantityAsInt >= 2) {
                         const total = offer.argument * Math.floor(quantityAsInt / x) + quantityAsInt % 2 * unitPrice;
                         const discountN = unitPrice * quantity - total;
-                        discount = new Discount(product, "2 for " + offer.argument, discountN);
+                        discount = new Discount(product, "" + offer.argument, discountN);
                     }
 
killedBy: Supermarket Two for amount
statusReason: expected '1.5' to equal '2 for 1.5'

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:70:23
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
                     }
 
-                } if (offer.offerType == SpecialOfferType.FiveForAmount) {
+                } if (true) {
                     x = 5;
                 }
killedBy: Supermarket Three for two discount
statusReason: expected +0 to be close to 1.98 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:70:23
                         discount = new Discount(product, "2 for " + offer.argument, discountN);
                     }
 
-                } if (offer.offerType == SpecialOfferType.FiveForAmount) {
+                } if (false) {
                     x = 5;
                 }
killedBy: Supermarket Five for amount
statusReason: expected 7.5 to be close to 1.5 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:73:47
                 } if (offer.offerType == SpecialOfferType.FiveForAmount) {
                     x = 5;
                 }
-                const numberOfXs = Math.floor(quantityAsInt / x);
+                const numberOfXs = Math.floor(quantityAsInt * x);
                 if (offer.offerType == SpecialOfferType.ThreeForTwo && quantityAsInt > 2) {
                     const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
killedBy: Supermarket Three for two discount
statusReason: expected 17.82 to be close to 1.98 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:74:21
                     x = 5;
                 }
                 const numberOfXs = Math.floor(quantityAsInt / x);
-                if (offer.offerType == SpecialOfferType.ThreeForTwo && quantityAsInt > 2) {
+                if (true) {
                     const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
killedBy: Supermarket Two for amount
statusReason: expected 3.96 to be close to 1.5 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:74:21
                     x = 5;
                 }
                 const numberOfXs = Math.floor(quantityAsInt / x);
-                if (offer.offerType == SpecialOfferType.ThreeForTwo && quantityAsInt > 2) {
+                if (true && quantityAsInt > 2) {
                     const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
killedBy: Supermarket Two for amount buy seven
statusReason: expected 6.93 to be close to 5.49 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:75:44
                 }
                 const numberOfXs = Math.floor(quantityAsInt / x);
                 if (offer.offerType == SpecialOfferType.ThreeForTwo && quantityAsInt > 2) {
-                    const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
+                    const discountAmount = quantity * unitPrice + (numberOfXs * 2 * unitPrice + quantityAsInt % 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
killedBy: Supermarket Three for two discount
statusReason: expected -1.9799999999999995 to be close to 1.98 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:75:99
                 }
                 const numberOfXs = Math.floor(quantityAsInt / x);
                 if (offer.offerType == SpecialOfferType.ThreeForTwo && quantityAsInt > 2) {
-                    const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
+                    const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt * 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
killedBy: Supermarket Three for two discount
statusReason: expected 10.89 to be close to 1.98 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:78:21
                     const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
-                if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
+                if (true) {
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
killedBy: Supermarket Three for two discount
statusReason: expected 2.673 to be close to 1.98 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:78:21
                     const discountAmount = quantity * unitPrice - ((numberOfXs * 2 * unitPrice) + quantityAsInt % 3 * unitPrice);
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
-                if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
+                if (false) {
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:79:80
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
                 if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
-                    discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
+                    discount = new Discount(product, offer.argument + "% off", quantity / unitPrice * offer.argument / 100.0);
                 }
                 if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
killedBy: Supermarket Ten percent discount
statusReason: expected [ Discount{ …(3) } ] to deeply equal [ { description: '10% off', …(2) } ]

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:79:80
                     discount = new Discount(product, "3 for 2", discountAmount);
                 }
                 if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
-                    discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
+                    discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument * 100.0);
                 }
                 if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
killedBy: Supermarket Ten percent discount
statusReason: expected -989.01 to be close to 0.891 +/- 0.01

[Killed] EqualityOperator
src/model/ShoppingCart.ts:81:74
                 if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
-                if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
+                if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt < 5) {
                     const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
killedBy: Supermarket Five for amount
statusReason: expected 4.95 to be close to 1.5 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:81:74
                 if (offer.offerType == SpecialOfferType.TenPercentDiscount) {
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
-                if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
+                if (offer.offerType == SpecialOfferType.FiveForAmount && true) {
                     const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
killedBy: Supermarket Five for amount below threshold gives no discount
statusReason: expected 1 to equal +0

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:82:67
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
                 if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
-                    const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
+                    const discountTotal = unitPrice * quantity - (offer.argument / numberOfXs + quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
                 }
killedBy: Supermarket Five for amount X2
statusReason: expected 0.75 to be close to 3 +/- 0.01

[Killed] ArithmeticOperator
src/model/ShoppingCart.ts:82:67
                     discount = new Discount(product, offer.argument + "% off", quantity * unitPrice * offer.argument / 100.0);
                 }
                 if (offer.offerType == SpecialOfferType.FiveForAmount && quantityAsInt >= 5) {
-                    const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
+                    const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs - quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
                 }
killedBy: Supermarket Five for amount buy seven
statusReason: expected 1.5199999999999996 to be close to 5.48 +/- 0.01

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:85:21
                     const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
                 }
-                if (discount != null)
+                if (true)
                     receipt.addDiscount(discount);
             }
killedBy: Supermarket Three for two below threshold gives no discount
statusReason: Cannot read properties of null (reading 'discountAmount')

[Killed] ConditionalExpression
src/model/ShoppingCart.ts:85:21
                     const discountTotal = unitPrice * quantity - (offer.argument * numberOfXs + quantityAsInt % 5 * unitPrice);
                     discount = new Discount(product, x + " for " + offer.argument, discountTotal);
                 }
-                if (discount != null)
+                if (false)
                     receipt.addDiscount(discount);
             }
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01
