[Killed] BlockStatement
src/model/Teller.ts:15:100
     public constructor(private readonly catalog: SupermarketCatalog ) {
     }
 
-    public addSpecialOffer(offerType: SpecialOfferType , product: Product, argument: number): void {
-        this.offers[product.name] = new Offer(offerType, product, argument);
-    }
+    public addSpecialOffer(offerType: SpecialOfferType , product: Product, argument: number): void {}
 
     public checksOutArticlesFrom(theCart: ShoppingCart): Receipt {
killedBy: Supermarket Ten percent discount
statusReason: expected 0.99 to be close to 0.891 +/- 0.01

[Killed] BlockStatement
src/model/Teller.ts:19:66
         this.offers[product.name] = new Offer(offerType, product, argument);
     }
 
-    public checksOutArticlesFrom(theCart: ShoppingCart): Receipt {
-        const receipt = new Receipt();
-        const productQuantities = theCart.getItems();
-        for (let pq of productQuantities) {
-            let p = pq.product;
-            let quantity = pq.quantity;
-            let unitPrice = this.catalog.getUnitPrice(p);
-            let price = quantity * unitPrice;
-            receipt.addProduct(p, quantity, unitPrice, price);
-        }
-        theCart.handleOffers(receipt, this.offers, this.catalog);
-
-        return receipt;
-    }
+    public checksOutArticlesFrom(theCart: ShoppingCart): Receipt {}
 
 }
killedBy: Supermarket No discount
statusReason: Cannot read properties of undefined (reading 'getTotalPrice')

[Killed] BlockStatement
src/model/Teller.ts:22:43
     public checksOutArticlesFrom(theCart: ShoppingCart): Receipt {
         const receipt = new Receipt();
         const productQuantities = theCart.getItems();
-        for (let pq of productQuantities) {
-            let p = pq.product;
-            let quantity = pq.quantity;
-            let unitPrice = this.catalog.getUnitPrice(p);
-            let price = quantity * unitPrice;
-            receipt.addProduct(p, quantity, unitPrice, price);
-        }
+        for (let pq of productQuantities) {}
         theCart.handleOffers(receipt, this.offers, this.catalog);
 
killedBy: Supermarket No discount
statusReason: expected +0 to be close to 4.975 +/- 0.01

[Killed] ArithmeticOperator
src/model/Teller.ts:26:25
             let p = pq.product;
             let quantity = pq.quantity;
             let unitPrice = this.catalog.getUnitPrice(p);
-            let price = quantity * unitPrice;
+            let price = quantity / unitPrice;
             receipt.addProduct(p, quantity, unitPrice, price);
         }
killedBy: Supermarket No discount
statusReason: expected 1.256281407035176 to be close to 4.975 +/- 0.01
